{
  "description": [
    "The Illinois Supreme Court and the Administrative Office of Illinois Courts commissioned the Sixth Amendment Center to conduct an evaluation of Illinois’ public defense system in nine counties. In 2021, the Sixth Amendment Center published their findings in a report titled, ",
    {
      "href": "https://6ac.org/wp-content/uploads/2024/02/6AC_illinois_report_2021.pdf",
      "text": "The Right to Counsel in Illinois: An Evaluation of Adult Criminal Trial Level Indigent Services, "
    },
    "The Right to Counsel in Illinois: An Evaluation of Adult Criminal Trial Level Indigent Services. The report concluded that the State fails to fulfill its constitutional obligation under the Sixth Amendment to provide adequate public defense for individuals unable to afford private attorneys (also known as an individual’s right to counsel). This stems from major structural deficiencies within Illinois' public defense system:  "
  ],
  "list": [
    "Lack of Oversight. Although the State delegates the provision of public defense to county boards and circuit court judges, there is no oversight body to ensure the constitutional obligation is being met. As a result, public defense throughout Illinois’ 102 counties is severely under-resourced and understaffed, making it difficult to provide effective assistance of counsel.",
    "Lack of Independence: In the absence of statewide standards, public defense administration is subject to political and judicial interference. When politically or judicially appointed, defense attorneys may face conflicts of interest when representing their clients. Without an appointment process independent of political and judicial influence, systemic conflicts of interest make it nearly impossible for the public defenders to provide effective assistance of counsel."
  ],
  "paragraph": "In January 2022, Northwestern University faculty, law students, graduate and undergraduate students, and staff from the Children and Family Justice Center and the Sociology Department formed a research team to gain a deeper understanding of the nature and extent of the structural deficiencies in Illinois' public defense system. For over two years, the research team collected and analyzed data on resource distribution across all 102 counties, resulting in a comprehensive, statewide database on public defense implementation in Illinois. This website is intended to share these findings with the public."
}
