{
  "description": [
    "A recent Sixth Amendment Center evaluation of indigent defense systems in nine Illinois counties, ",
    {
      "href": "https://6ac.org/wp-content/uploads/2024/02/6AC_illinois_report_2021.pdf",
      "text": "The Right to Counsel in Illinois: An Evaluation of Adult Criminal Trial Level Indigent Services, "
    },
    "commissioned by the Illinois Supreme Court through the Administrative Office of Illinois Courts, concluded that:"
  ],
  "list": [
    "The State of Illinois delegates to its county boards and circuit court judges most of its constitutional obligation to ensure the provision of effective assistance of counsel to indigent criminal defendants in the trial courts. Yet the state does not have any oversight structure by which to know whether each county’s indigent defense system has a sufficient number of attorneys with the necessary time, training, and resources to provide effective assistance of counsel at every critical stage of a criminal case for each and every indigent defendant.",
    "The state’s limited framework for how county boards and circuit court judges are to establish and implement the indigent defense system in each county institutionalizes political and judicial interference with the appointed attorneys’ independence to act in the stated legal interests of their indigent clients. This lack of independence causes systemic conflicts of interest that interfere with the provision of effective assistance of counsel.",
    "The indigent defense systems established in Illinois’ counties lack oversight and accountability that can result in a constructive denial of the right to counsel to at least some indigent defendants, and in some instances can result in the actual denial of the right to counsel to at least some indigent defendants. (Sixth Amendment Center 2021, p.iii-iv)."
  ],
  "paragraph": "In January 2022, faculty, law students, graduate and undergraduate students, and staff at the Children and Family Justice Center and the Sociology Department at Northwestern University (“the research team”) convened to develop a research strategy to better understand the nature and scope of these deficiencies in Illinois` indigent defense system. Since then, the research team collected, verified, and analyzed a large, statewide database that details how indigent defense resources are distributed across all 102 Illinois counties."
}
